刚才学习的 for loop 的主要功能是用来做迭代
而 while loop的主要功能是根据一个或多个布尔条件来循环某些语句。
简单地说，只要 while 关键词右边的'布尔条件'处于 True 状态, while loop 就可以让其'代码块中'的语句循环运行

1. while 的基本用法
--------------------------------------------------------------------------------
sheep = 0

print("睡不着，开始数羊...")

while sheep != 10:  # 只要 sheep 这个变量不为10，while 代码块中的语句就会不停地循环
    sheep += 1
    print("{}只羊。".format(sheep))

print("终于睡着了。")
--------------------------------------------------------------------------------


2. 无限循环 while True
--------------------------------------------------------------------------------
while True:
    user_number = input("请输入一个数： ")
--------------------------------------------------------------------------------


3. 用关键词 break 来打破循环
--------------------------------------------------------------------------------
while True:
    user_number = input("请输入一个数： ")
    if user_number == "666":
        break
--------------------------------------------------------------------------------


4. 用关键词 continue 来回到当前循环的最初的语句
--------------------------------------------------------------------------------
while True:
    question_1 = input("1 + 1 等于几： ")
    if question_1 != "2":
        print("回答错误！重来！")
        continue
    else:
        break

while True:

    if question_2 != "10":
        print("回答错误！重来！")
        continue
    else:
        break
--------------------------------------------------------------------------------
