概念：
    之前我们运行Python程序都是'直接运行'写好的脚本(.py文件)。
    脚本一旦运行完毕，程序就会'自动结束'。
    现在，我要介绍一种非常实用的操作 —— 以'REPL'模式运行.py文件

方法：
    打开控制台，无需变更路径, 输入 'python'，按回车
    按 'CTRL + Z' 可以退出REPL，也可以退出任何正在运行的脚本


REPL的全称：
    Read          读取
    Evaluate      运算
    Print         打印
    Loop          循环

简单的来说，REPL模式可以让你'快速地实验某个代码'，它就是你的试验场。
我们来试试!


# TODO: 进入REPL模式
# TODO: 输入 1 + 1，按回车
# TODO: 输入 50 - 25，按回车
# TODO: 输入 100 * 15，按回车
# TODO: 输入 100 / 2，按回车
# TODO: 输入 100 % 3，按回车
# TODO: 输入 5 > 2，按回车
# TODO: 输入 10 < 11，按回车
# TODO: 输入 666 >= 666，按回车
# TODO: 输入 800 <= 50，按回车
