# TODO: 创建文件 ex3.py
# TODO: 接着刚才的练习，假设现在你打败了一条龙，它的掉落是一个列表：
dragon_loot = ['金币', '匕首', '金币', '金币', '红宝石']
# TODO: 写一个函数，传递两个参数，一个是背包(字典), 一个是获得的掉落(列表)
# TODO: 调用这个函数可以往背包中添加列表中的物品, 类似如下：


--------------------------------------------------------------------------------
# 代码：
def add_to_inventory(inventory, loot):
    # 这里写你的代码

def display_inventory(inventory):
    # 这里可以使用 ex2.py 中用来显示背包的函数

inventory = {
    '金币': 42,
    '绳子': 1
}

dragon_loot = ['金币', '匕首', '金币', '金币', '红宝石']
inventory = add_to_inventory(inventory, dragon_loot)
display_inventory()
--------------------------------------------------------------------------------
# 输出结果：
背包:
45x 金币
1x 绳子
1x 红宝石
1x 匕首
