列表是python中的一种常见的数据类型，你可以在其中放入多种数据。

例子：
    # 这是一个列表，我在里面放入了所有我负责指导毕业设计的学生的名字
    graduation_project_students = ['唐宇', '王馨', '凡安顺', '向港', '袁悦', '李青松', '谭定坤', '黎永明', '龙燕', '谭旭滟', '邹雨辰', '梁桥', '王杰', '刘江']


    # 如果列表太长不易观看，也可以这么写：
    graduation_project_students = [
    '唐宇',
    '王馨',
    '凡安顺',
    '向港',
    '袁悦',
    '李青松',
    '谭定坤',
    '黎永明',
    '龙燕',
    '谭旭滟',
    '邹雨辰',
    '梁桥',
    '王杰',
    '刘江']

    # 字符串是 '可迭代对象'(iterable)，所以我们也可以通过字符串创建列表
    # 在 REPL 中试试下列命令：
        list('重庆机电职业技术学院')
