cypher1 = ['田', '王', '盖', '虎']
cypher2 = ['宝', '塔', '黑', '妖']

# TODO: 老师给出以上两个列表，里面存储了一些暗号字，现在试试运行这个脚本。
# TODO: 看来我们列表上的暗号不正确，我们用刚才学到的索引知识来解决这个问题。

# TODO: 在不直接修改列表的前提下，使用索引来修改或向列表中特定位置插入正确的暗号字
# TODO: 最后让两个列表中的暗号字可以被合成为正确的暗号句，合成代码在下方，看看就好，无需变动
# TODO: 正确的暗号请看下方的 if 语句
# TODO: 你的最终目的是要让你的暗号通过！

# TODO: 你的代码写在下一行：
# ------------------------------------------------------------------------------
cypher1[0] = '天'
cypher1.insert(-1, '地')
cypher2[2] = '河'
cypher2.insert(2, '阵')







#-------------------------------------------------------------------------------
# 暗号合成处
decypher1 = ''.join(cypher1)
decypher2 = ''.join(cypher2)

print(decypher1)
print(decypher2)

if decypher1 == '天王盖地虎' and decypher2 == '宝塔阵河妖':
    print("\n口号正确")
    print("看来我们是兄弟!")
else:
    print("\n口号错误")
    print("哪来的二五仔！")
