# TODO: 老师提供以下列表
list = [1,2,3,4,5,6,7,8,9,10]

# TODO: 写一个函数，传递一个 可迭代对象 (字符串，列表), 返回这个对象中的 奇数索引 作为切片
# TODO: 奇数索引是指[1][3][5]...之类的索引，不是指列表中的奇数数字，切记
odds(list)
返回 [2,4,6,8,10]

# TODO: 写一个函数，传递一个 可迭代对象 (字符串，列表), 返回这个对象中的 前4位 作为切片
first_4(list)
返回 [1,2,3,4]

# TODO: 写一个函数，传递一个 可迭代对象 (字符串，列表), 返回这个对象中的 前4位 以及 后4位 作为切片
first_and_last_4(list)
返回 [1,2,3,4,7,8,9,10]

# TODO: 写一个函数，传递一个 可迭代对象 (字符串，列表), 取这个对象中的偶数索引，并将它们反转，最后返回。
# TODO: 偶数索引是指[2][4][6]...之类的索引，不是指列表中的偶数数字，切记
reverse_evens(list)
返回 [9,7,5,3,1]
